app/controllers/booking_types_controller.rb

INSERT INTO "booking_types" ("name", "location", "color", "duration", "payment_required", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
   def create
    @booking_type = current_user.booking_types.new(booking_type_params)

    respond_to do |format|
      if @booking_type.save

UPDATE "booking_types" SET "name" = $1, "duration" = $2, "price" = $3, "updated_at" = $4 WHERE "booking_types"."id" = $5  [["name", "semiu"], ["duration", 5], ["price", 50], ["updated_at", "2023-11-21 14:12:17.211570"], ["id", 41]]
---
  def update
    respond_to do |format|
      if @booking_type.update(booking_type_params)

DELETE FROM "booking_types" WHERE "booking_types"."id" = $1  [["id", 8]]
---
  def destroy
    @booking_type.destroy

SELECT "booking_types".* FROM "booking_types" WHERE "booking_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_booking_type
      @booking_type = BookingType.find(params[:id])