app/controllers/bookings_controller.rb

SELECT "booking_types".* FROM "booking_types" WHERE "booking_types"."name" = $1 LIMIT $2  [["name", "15min"], ["LIMIT", 1]]
---
  def new
    @booking = Booking.new
    @booking_type = BookingType.find_by(name: params[:booking_type])

SELECT "booking_types".* FROM "booking_types" WHERE "booking_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bookings" ("status", "start_at", "end_at", "first_name", "last_name", "email", "customer_paid", "created_at", "updated_at", "booking_type_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @booking = Booking.new(booking_params)
    @booking_type = BookingType.find(params[:booking][:booking_type_id])

    respond_to do |format|
      if @booking.save

UPDATE "bookings" SET "status" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["status", 2], ["updated_at", "2023-11-21 16:19:42.191468"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @booking.update(booking_params)

SELECT "booking_types".* FROM "booking_types" WHERE "booking_types"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def intent
    @booking_type = BookingType.find(params[:_json])

SELECT "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_booking
      @booking = Booking.find(params[:id])