app/controllers/users_controller.rb

  def show
    @user = User.find_by(booking_link: params[:booking_link])
---
SELECT "users".* FROM "users" WHERE "users"."booking_link" = $1 LIMIT $2  [["booking_link", "bookings"], ["LIMIT", 1]]